new_blog_arch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-04 日 13:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New(and Newer) Blog Architecture</title>
<meta name="author" content="dongdigua" />
<meta name="description" content="It's time" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/main.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./../posts"> UP </a>
 |
 <a accesskey="H" href="https://dongdigua.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">New(and Newer) Blog Architecture</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a>1. Branch</a>
<ul>
<li><a>1.1. Idea is:</a>
<ul>
<li><a>1.1.1. clearly look at the diff</a></li>
<li><a>1.1.2. delete the generated files if I want</a></li>
</ul>
</li>
<li><a>1.2. So what</a>
<ul>
<li><a>1.2.1. use <code>filter-branch</code> to remove the huge <code>feed.xml</code> in the full history</a></li>
<li><a>1.2.2. ignore the generated files in the source repo</a></li>
<li><a>1.2.3. merge the source repo into site repo when I think it's ok</a></li>
<li><a>1.2.4. <del>and I will use the same stratagy on my YW sub-website if there's no problem</del></a></li>
</ul>
</li>
<li><a>1.3. Need Advice</a></li>
</ul>
</li>
<li><a>2. CI</a></li>
</ul>
</div>
</div>

<div class="outline-2">
<h2><span class="section-number-2">1.</span> Branch</h2>
<div class="outline-text-2" id="text-1">
<p>
I've never fully learnt git before(only search for garbage when meeted with problem), so I recently read <a href="https://git-scm.com/book">ProGit</a>.<br />
And I have some good ideas on my repo architecture: I should make use of branch, obviously.<br />
</p>
</div>

<div class="outline-3">
<h3><span class="section-number-3">1.1.</span> Idea is:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
seperate the source file(org) and the generated files(html, feed.xml)<br />
so I can<br />
</p>
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.1.1.</span> clearly look at the diff</h4>
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.1.2.</span> delete the generated files if I want</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
because those static files are really unecessary and takes much space<br />
</p>
</div>
</div>
</div>

<div class="outline-3">
<h3><span class="section-number-3">1.2.</span> So what</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.2.1.</span> use <code>filter-branch</code> to remove the huge <code>feed.xml</code> in the full history</h4>
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.2.2.</span> ignore the generated files in the source repo</h4>
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.2.3.</span> merge the source repo into site repo when I think it's ok</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
don't remove the source(org) in the site repo,<br />
if build in main and checkout to site, those html will be overwritten<br />
</p>
</div>
</div>
<div class="outline-4">
<h4><span class="section-number-4">1.2.4.</span> <del>and I will use the same stratagy on my YW sub-website if there's no problem</del></h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
I'm testing using CI on YW sub-site before deploying on this precious repo<br />
</p>
</div>
</div>
</div>

<div class="outline-3">
<h3><span class="section-number-3">1.3.</span> Need Advice</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<del>I'm really new to do this. If you have a better idea, or this is somehow useful to you,</del><br />
<del><b>contact me, please!</b></del><br />
</p>
</div>
</div>
</div>

<div class="outline-2">
<h2><span class="section-number-2">2.</span> CI</h2>
<div class="outline-text-2" id="text-2">
<p>
I previously thought of using CI to deploy blog, but I <i>thought</i> it too difficult, so just keep status quo.<br />
But for many times I want to build a <a href="https://github.com/dongdigua/configs/blob/main/configuration.nix">NixOS</a> with <a href="https://donngdigua.github.io/wayland">wayland</a> and lots of other big util(such as clang and metasploit),<br />
if I build it on my machine, it will take up too many spaces and make no use except for building iso.<br />
So it urged me to use a CI, after some <a href="https://t.bilibili.com/735422465675624481">trying</a>, I found it not difficult and in fact, very useful!<br />
</p>

<p>
I can have my huge feed.xml(which contains each of my post) dynamically generated by CI, it will save lots of spaces!<br />
I will <a href="https://git-scm.com/book/en/v2/Git-Tools-Bundling">bundle</a> my entire history mess and put it on release, like previous big change,<br />
then use the Nuclear Option <code>filter-branch</code> to delete those generated big files.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: dongdigua</p>
<p class="date">Date: 2022-11-20 日 00:00</p>
<p class="date">Build: 2022-12-04 日 13:34</p>
<p>LICENCE: CC BY-NC-SA</p>
<p>If you have any idea, please contact me! I may add your comment</p>
</div>
</body>
</html>
